## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/57819960/runs/235555e5-2692-4e1e-81aa-615b8ee7cb0b).

This is a **layered run** with 1 layers remaining to apply.  Layered runs require multiple rounds of planning and applying.  After applying this layer, comment `terrateam plan` to plan the next layer and continue until all layers are applied.

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>



## Dir: layers/services | Success :thumbsup:
**Dir**: layers/services
**Workspace**: default
**Success**: :thumbsup:
**Command**: `tofu plan -detailed-exitcode -out /tmp/tmp2jckvl8_/plan`

```diff

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy

OpenTofu will perform the following actions:

  # module.proxysql.module.proxysql_deployment.akash_deployment.service will be updated in-place
!   resource "akash_deployment" "service" {
        id                            = "19248539:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
!       sdl                           = (sensitive value)
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mysql_cluster.module.master.module.mysql_deployment.akash_deployment.service will be destroyed
  # (because akash_deployment.service is not in configuration)
-   resource "akash_deployment" "service" {
-       deployment_dseq               = "19250221" -> null
-       deployment_gseq               = "1" -> null
-       deployment_oseq               = "1" -> null
-       deployment_owner              = "***" -> null
-       deployment_state              = "active" -> null
-       escrow_account_balance_amount = "500000.000000000000000000" -> null
-       escrow_account_balance_denom  = "uakt" -> null
-       escrow_account_owner          = "***" -> null
-       id                            = "19250221:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
-       last_updated                  = "Saturday, 07-Dec-24 17:27:10 UTC" -> null
-       provider_address              = "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
-       sdl                           = (sensitive value) -> null
-       services                      = [
-           {
-               available          = 1
-               available_replicas = 1
-               forwarded_ports    = [
-                   {
-                       external_port = 30749
-                       host          = "provider.ny-01.node.infra.lumeweb.com"
-                       port          = 3306
-                       proto         = "TCP"
                    },
                ]
-               ips                = []
-               name               = "mysql-master-dev-881856c4"
-               ready_replicas     = 1
-               replicas           = 1
-               total              = 1
-               updated_replicas   = 1
-               uris               = []
            },
        ] -> null

-       provider_filters {
-           enforce   = true -> null
-           providers = [
-               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ] -> null
        }
    }

  # module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = [
+               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service will be created
+   resource "akash_deployment" "service" {
+       deployment_dseq               = (known after apply)
+       deployment_gseq               = (known after apply)
+       deployment_oseq               = (known after apply)
+       deployment_owner              = (known after apply)
+       deployment_state              = (known after apply)
+       escrow_account_balance_amount = (known after apply)
+       escrow_account_balance_denom  = (known after apply)
+       escrow_account_owner          = (known after apply)
+       id                            = (known after apply)
+       last_updated                  = (known after apply)
+       provider_address              = (known after apply)
+       sdl                           = (sensitive value)
+       services                      = (known after apply)

+       provider_filters {
+           enforce   = true
+           providers = [
+               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql_cluster.module.slaves["0"].module.mysql_deployment.akash_deployment.service will be destroyed
  # (because akash_deployment.service is not in configuration)
-   resource "akash_deployment" "service" {
-       deployment_dseq               = "19250224" -> null
-       deployment_gseq               = "1" -> null
-       deployment_oseq               = "1" -> null
-       deployment_owner              = "***" -> null
-       deployment_state              = "active" -> null
-       escrow_account_balance_amount = "500000.000000000000000000" -> null
-       escrow_account_balance_denom  = "uakt" -> null
-       escrow_account_owner          = "***" -> null
-       id                            = "19250224:1:1:***:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
-       last_updated                  = "Saturday, 07-Dec-24 17:27:25 UTC" -> null
-       provider_address              = "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn" -> null
-       sdl                           = (sensitive value) -> null
-       services                      = [
-           {
-               available          = 1
-               available_replicas = 1
-               forwarded_ports    = [
-                   {
-                       external_port = 30774
-                       host          = "provider.ny-01.node.infra.lumeweb.com"
-                       port          = 3306
-                       proto         = "TCP"
                    },
                ]
-               ips                = []
-               name               = "mysql-slave-0-dev-454b0509"
-               ready_replicas     = 1
-               replicas           = 1
-               total              = 1
-               updated_replicas   = 1
-               uris               = []
            },
        ] -> null

-       provider_filters {
-           enforce   = true -> null
-           providers = [
-               "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ] -> null
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
!   mysql_cluster = {
-       master   = {
-           endpoint = "provider.ny-01.node.infra.lumeweb.com:30749"
-           host     = "provider.ny-01.node.infra.lumeweb.com"
-           port     = 30749
        }
+       nodes    = {
+           "0" = {
+               endpoint = (known after apply)
+               host     = (known after apply)
+               port     = (known after apply)
            }
+           "1" = {
+               endpoint = (known after apply)
+               host     = (known after apply)
+               port     = (known after apply)
            }
        }
-       replicas = {
-           "0" = {
-               endpoint = "provider.ny-01.node.infra.lumeweb.com:30774"
-               host     = "provider.ny-01.node.infra.lumeweb.com"
-               port     = 30774
            }
        }
        # (1 unchanged attribute hidden)
    }

```


</details>


---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
